<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"c8363379027cbc3c047865902d9ef8b37c59ddce7f4c9f0b0fde888ed9a9f820","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #645 at https://github.com/cal-itp/data-infra/actions/runs/17810242605","plan_out_hash":"f415e6fc572313d66e138936f26ef2f8a0bf141a7aa69be90290fa1cf2c214a7","plan_hash":"4c9a54349827769e2ccfc15b81aa81d68c87885de57d6b521463743873c9f210","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 7 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "Tev42g==" -> (known after apply)
!~      detect_md5hash      = "WH9/csQm9d1jFHYJ9tDp6w==" -> "different hash"
!~      generation          = 1757541552203979 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "WH9/csQm9d1jFHYJ9tDp6w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "DBKOFQ==" -> (known after apply)
!~      detect_md5hash      = "EHZOXRbPVtIwvJkQEotrvA==" -> "different hash"
!~      generation          = 1755017162932574 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
!~      md5hash             = "EHZOXRbPVtIwvJkQEotrvA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs/int_gtfs_rt__trip_updates_trip_stop_day_map_grouping.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "JL7V4Q==" -> (known after apply)
!~      detect_md5hash      = "Tb+4IoLBltYcfLI1TPpjyg==" -> "different hash"
!~      generation          = 1755017162926283 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
!~      md5hash             = "Tb+4IoLBltYcfLI1TPpjyg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_stop_time_updates_sample.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "ZD8o+g==" -> (known after apply)
!~      detect_md5hash      = "imHQqPBt12/RTVHBceqcyw==" -> "different hash"
!~      generation          = 1755017162614232 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_stop_time_updates_sample.sql"
!~      md5hash             = "imHQqPBt12/RTVHBceqcyw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_stop_time_updates_sample.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_trip_updates_stop_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "UQSAQw==" -> (known after apply)
!~      detect_md5hash      = "tSKf4xP5Ah4HdhGBjf+OZQ==" -> "different hash"
!~      generation          = 1755017162927330 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
!~      md5hash             = "tSKf4xP5Ah4HdhGBjf+OZQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_stop_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_trip_updates_trip_metrics.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "fdJWgA==" -> (known after apply)
!~      detect_md5hash      = "jfDXHvDU1Ek5aQiuevlFVA==" -> "different hash"
!~      generation          = 1755017162933204 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
!~      md5hash             = "jfDXHvDU1Ek5aQiuevlFVA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_trip_metrics.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "0PcBgA==" -> (known after apply)
!~      detect_md5hash      = "TuukowzlGluvU+BnYGmOkA==" -> "different hash"
!~      generation          = 1757541553964048 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "TuukowzlGluvU+BnYGmOkA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #645](https://github.com/cal-itp/data-infra/actions/runs/17810242605)